export const functions = {

    slug(text) {
        let search = [
            '’', ' - ', '?', '(', ')', '\'', ' ', '/', '*', '!', '@', '#', '$', '%', '^', '&', '*', '(', ')', '{', '}', '"', '\\', '`', '~',
            'i', 'ğ', 'Ğ', 'ə', 'Ə', 'I', 'İ', 'ı', 'I', 'ö', 'Ö', 'ç', 'Ç', 'ş', 'Ş', 'ü', 'Ü', 'A', 'B', 'C', 'D', 'E', 'F', 'G', 'H', 'I', 'J', 'K', 'L', 'M', 'N', 'O', 'P', 'Q', 'R', 'S', 'T', 'U', 'V', 'W', 'X', 'Y', 'Z',
            'а', 'б', 'в', 'г', 'д', 'е', 'ж', 'з', 'и', 'й', 'к', 'л', 'м', 'н', 'о', 'п', 'р', 'с', 'т', 'у', 'ф', 'х', 'ц', 'ч', 'ш', 'щ', 'ъ', 'ь', 'ю', 'я', 'э', 'ё', 'ы',
            'А', 'Б', 'В', 'Г', 'Д', 'Е', 'Ж', 'З', 'И', 'Й', 'К', 'Л', 'М', 'Н', 'О', 'П', 'Р', 'С', 'Т', 'У', 'Ф', 'Х', 'Ц', 'Ч', 'Ш', 'Щ', 'Ъ', 'Ь', 'Ю', 'Я', 'Э', 'Ё', 'Ы'
        ];
        let replacement = [
            '', '-', '', '', '', '', '-', '-', '-', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '',
            'i', 'g', 'g', 'e', 'e', 'i', 'i', 'i', 'i', 'o', 'o', 'c', 'c', 's', 's', 'u', 'u', 'a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j', 'k', 'l', 'm', 'n', 'o', 'p', 'q', 'r', 's', 't', 'u', 'v', 'w', 'x', 'y', 'z',
            'a', 'b', 'v', 'g', 'd', 'e', 'zh', 'z', 'i', 'y', 'k', 'l', 'm', 'n', 'o', 'p', 'r', 's', 't', 'u', 'f', 'h', 'ts', 'ch', 'sh', 'sht', 'a', 'y', 'yu', 'ya', 'e', 'yo', 'i',
            'a', 'b', 'v', 'g', 'd', 'e', 'zh', 'z', 'i', 'y', 'k', 'l', 'm', 'n', 'o', 'p', 'r', 's', 't', 'u', 'f', 'h', 'ts', 'ch', 'sh', 'sht', 'a', 'y', 'yu', 'ya', 'e', 'yo', 'i'
        ];
        for (let i = 0; i < search.length; i++) {
            text = text.split(search[i]).join(replacement[i]);
        }
        return text;
    },

    htmlToText(str){
        return str.replace(/<[^>]*>?/gm, '');
    },

    tokenHeader(token) {
        return  {
            headers: {
                "Accept": "application/json",
                "Content-Type": "application/json",
                "Authorization": `Bearer ${token}`
            }
        };
    }

};